app/Controllers/Register.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'phone_no' => 'required|is_unique[users.phone_no]|integer',
            'email' => 'required|valid_email',
            'phone_no' => 'required|integer',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        }

        $userData = [
            'name' => $this->request->getVar('name'),
            'email'     => $this->request->getVar('email'),
            'phone_no'  => $this->request->getVar('phone_no'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT)
        ];

        $model = new UserModel();
        $registered = $model->insert($userData);
---
INSERT INTO `users` (`name`, `email`, `phone_no`, `password`) VALUES ('Zul Lbs', 'zulv1122asnd3@gmail.com', '0821112400106', '$2y$10$Scr3f.6SkJKMytqJuJ5stONffGcnJ09qQWEMRKcX32xiO9ANjPM76')