app/Controllers/User.php

SELECT *
FROM `users`
WHERE `id` = '8'
 LIMIT 1
---
    public function index()
    {
        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        $token = explode(' ', $header)[1];
        $userData = JWT::decode($token, new Key($key, getenv('ALGORITHMS')));
        $modelUser = new UserModel();
        $user = $modelUser->where('id', $userData->uid)->first();